function cal() {
    var v1 = Number(document.getElementById("v1").value); // 난이도
    var v2 = Number(document.getElementById("v2").value); // 몬스터
    var v3 = Number(document.getElementById("v3").value); // 파티원
    var v4 = Number(document.getElementById("v4").value); // 인원

    var res1; //알반 더하기

    res1 = v1 + v2 + v3 + v4;

    document.getElementById("res1").value = res1;

    var res2; //등급

    if (res1 < 70) { res2 = "C" }
    else if (res1 < 100) { res2 = "B" }
    else if (res1 < 130) { res2 = "A" }
    else if (res1 < 190) { res2 = "S" }
    else { res2 = "SS" }

    document.getElementById("res2").value = res2;


    var res3; // A 만들기



    if (res1 < 100 && (100 - res1) <= 10 && v2 == 0 && v3 != 0) { res3 = "몬스터 (생명력 150%~500%, 대미지 150%~500%, 몹등장수 150%~200% 보호/방어 110%~150% 지력/행운120%~200%)" }
    else if (res1 < 100 && (100 - res1) <= 15 && v2 == 0 && v3 != 0) { res3 = "몬스터 (방어/보호120%~150%, 대미지/생명력 300%~500%, 등장수 150%~200%, 지력/행운 150%~200%)" }
    else if (res1 < 100 && (100 - res1) <= 20 && v2 == 0 && v3 != 0) { res3 = "몬스터 (방어/보호120%~150%, 대미지/생명력 300~500%, 등장수 150~200%, 지력/행운 200% )" }
    else if (res1 < 100 && (100 - res1) <= 25 && v2 == 0 && v3 != 0) { res3 = "몬스터 (방어/보호 150%, 대미지/생명력 300%~500%, 등장수200%)" }
    else if (res1 < 100 && (100 - res1) <= 30 && v2 == 0 && v3 != 0) { res3 = "몬스터 (보호 150%, 대미지/생명력 300%~500%, 등장수 200%)" }
    else if (res1 < 100 && (100 - res1) <= 40 && v2 == 0 && v3 != 0) { res3 = "몬스터 (등장수 200%, 생명력/대미지 500%)" }
    else if (res1 < 100 && (100 - res1) <= 45 && v2 == 0 && v3 != 0) { res3 = "몬스터 (생명력/대미지 500%)" }

    else if (res1 < 100 && (100 - res1) <= 10 && v2 != 0 && v3 == 0) { res3 = "파티원 (생/마/스 회복속도 50%~70%, 마법/궁술속도50%~70%, 근접대미지/생명력/크리티컬확률 50%~70%, 최대대미지 70%)" }
    // else if (res1 < 100 && (100 - res1) <= 15 && v2 != 0 && v3 == 0) { res3 = "파티원 (생/마/스 회복속도 50%, 마법/궁술속도50%, 근접대미지/생명력/크리티컬확률 50%, 최대대미지 50%~70%)" }
    else if (res1 < 100 && (100 - res1) <= 20 && v2 != 0 && v3 == 0) { res3 = "파티원 (생/마/스 회복속도 50%, 마법/궁술속도50%, 근접대미지/생명력/크리티컬확률 50%, 최대대미지 50%~70%)" }
    else if (res1 < 100 && (100 - res1) <= 30 && v2 != 0 && v3 == 0) { res3 = "파티원 (생명력 50%, 최대대미지 50%)" }
    else if (res1 < 100 && (100 - res1) <= 45 && v2 != 0 && v3 == 0) { res3 = "파티원 (최대대미지 50%)" }


    else if (res1 < 100 && (100 - res1) <= 55 && v2 == 0 && v3 == 0) { res3 = "몬스터 (생명력 150%~500%, 대미지 150%~500%, 몹등장수 150%~200% 보호/방어 110%~150% 지력/행운120%~200%) " }
    else if (res1 < 100 && (100 - res1) <= 60 && v2 == 0 && v3 == 0) { res3 = "몬스터 (방어/보호120%~150%, 대미지/생명력 300%~500%, 등장수 150%~200%, 지력/행운 150%~200%) " }
    else if (res1 < 100 && (100 - res1) <= 65 && v2 == 0 && v3 == 0) { res3 = "몬스터 (방어/보호120%~150%, 대미지/생명력 300~500%, 등장수 150~200%, 지력/행운 200% ) " }
    else if (res1 < 100 && (100 - res1) <= 70 && v2 == 0 && v3 == 0) { res3 = "몬스터 (보호 150%, 대미지/생명력 300%~500%, 등장수 200%) " }
    else if (res1 < 100 && (100 - res1) <= 85 && v2 == 0 && v3 == 0) { res3 = "몬스터 (등장수 200%, 생명력/대미지 500%)" }
    else if (res1 < 100 && (100 - res1) <= 90 && v2 == 0 && v3 == 0) { res3 = "몬스터 (생명력/대미지 500%)" }




    else { res3 = "만들수 없거나 다음레벨로 넘어감" }


    document.getElementById("res3").value = res3;


    var res3_1; // A 만들기
    if (res1 < 100 && (100 - res1) <= 55 && v2 == 0 && v3 == 0) { res3_1 = " 파티원 (생/마/스 회복속도 50%~70%, 마법/궁술속도50%~70%, 근접대미지/생명력/크리티컬확률 50%~70%, 최대대미지 70%)" }
    else if (res1 < 100 && (100 - res1) <= 60 && v2 == 0 && v3 == 0) { res3_1 = " 파티원 (생/마/스 회복속도 50%, 마법/궁술속도50%, 근접대미지/생명력/크리티컬확률 50%, 최대대미지 50%~70%) " }
    else if (res1 < 100 && (100 - res1) <= 65 && v2 == 0 && v3 == 0) { res3_1 = " 파티원 (생/마/스 회복속도 50%, 마법/궁술속도50%, 근접대미지/생명력/크리티컬확률 50%, 최대대미지 50%~70%)" }
    else if (res1 < 100 && (100 - res1) <= 70 && v2 == 0 && v3 == 0) { res3_1 = " 파티원 (생명력 50%, 최대대미지 50%)" }
    // else if (res1 < 100 && (100 - res1) <= 85 && v2 == 0 && v3 == 0) { res3_1 = " 파티원 (최대대미지 50%)" }
    else if (res1 < 100 && (100 - res1) <= 90 && v2 == 0 && v3 == 0) { res3_1 = " 파티원 (최대대미지 50%)" }

    else { res3_1 = "" }

    document.getElementById("res3_1").value = res3_1;



    var res4; // S 만들기

    if (res1 < 130 && (130 - res1) <= 10 && v2 == 0 && v3 != 0) { res4 = "몬스터 (생명력 150%~500%, 대미지 150%~500%, 몹등장수 150%~200% 보호/방어 110%~150% 지력/행운120%~200%)" }
    else if (res1 < 130 && (130 - res1) <= 15 && v2 == 0 && v3 != 0) { res4 = "몬스터 (방어/보호120%~150%, 대미지/생명력 300%~500%, 등장수 150%~200%, 지력/행운 150%~200%)" }
    else if (res1 < 130 && (130 - res1) <= 20 && v2 == 0 && v3 != 0) { res4 = "몬스터 (방어/보호120%~150%, 대미지/생명력 300~500%, 등장수 150~200%, 지력/행운 200% )" }
    else if (res1 < 130 && (130 - res1) <= 25 && v2 == 0 && v3 != 0) { res4 = "몬스터 (방어/보호 150%, 대미지/생명력 300%~500%, 등장수200%)" }
    else if (res1 < 130 && (130 - res1) <= 30 && v2 == 0 && v3 != 0) { res4 = "몬스터 (보호 150%, 대미지/생명력 300%~500%, 등장수 200%)" }
    else if (res1 < 130 && (130 - res1) <= 40 && v2 == 0 && v3 != 0) { res4 = "몬스터 (등장수 200%, 생명력/대미지 500%)" }
    else if (res1 < 130 && (130 - res1) <= 45 && v2 == 0 && v3 != 0) { res4 = "몬스터 (생명력/대미지 500%)" }

    else if (res1 < 130 && (130 - res1) <= 10 && v2 != 0 && v3 == 0) { res4 = "파티원 (생/마/스 회복속도 50%~70%, 마법/궁술속도50%~70%, 근접대미지/생명력/크리티컬확률 50%~70%, 최대대미지 70%)" }
    // else if (res1 < 130 && (130 - res1) <= 15 && v2 != 0 && v3 == 0) { res4 = "파티원 (생/마/스 회복속도 50%, 마법/궁술속도50%, 근접대미지/생명력/크리티컬확률 50%, 최대대미지 50%~70%)" }
    else if (res1 < 130 && (130 - res1) <= 20 && v2 != 0 && v3 == 0) { res4 = "파티원 (생/마/스 회복속도 50%, 마법/궁술속도50%, 근접대미지/생명력/크리티컬확률 50%, 최대대미지 50%~70%)" }
    else if (res1 < 130 && (130 - res1) <= 30 && v2 != 0 && v3 == 0) { res4 = "파티원 (생명력 50%, 최대대미지 50%)" }
    else if (res1 < 130 && (130 - res1) <= 45 && v2 != 0 && v3 == 0) { res4 = "파티원 (최대대미지 50%)" }



    else if (res1 < 130 && (130 - res1) <= 55 && v2 == 0 && v3 == 0) { res4 = "몬스터 (생명력 150%~500%, 대미지 150%~500%, 몹등장수 150%~200% 보호/방어 110%~150% 지력/행운120%~200%) " }
    else if (res1 < 130 && (130 - res1) <= 60 && v2 == 0 && v3 == 0) { res4 = "몬스터 (방어/보호120%~150%, 대미지/생명력 300%~500%, 등장수 150%~200%, 지력/행운 150%~200%) " }
    else if (res1 < 130 && (130 - res1) <= 65 && v2 == 0 && v3 == 0) { res4 = "몬스터 (방어/보호120%~150%, 대미지/생명력 300~500%, 등장수 150~200%, 지력/행운 200% ) " }
    else if (res1 < 130 && (130 - res1) <= 70 && v2 == 0 && v3 == 0) { res4 = "몬스터 (보호 150%, 대미지/생명력 300%~500%, 등장수 200%) " }
    else if (res1 < 130 && (130 - res1) <= 85 && v2 == 0 && v3 == 0) { res4 = "몬스터 (등장수 200%, 생명력/대미지 500%) " }
    else if (res1 < 130 && (130 - res1) <= 90 && v2 == 0 && v3 == 0) { res4 = "몬스터 (생명력/대미지 500%)" }

    else { res4 = "만들수 없거나 다음레벨로 넘어감" }


    document.getElementById("res4").value = res4;



    var res4_1; // s 만들기
    if (res1 < 130 && (130 - res1) <= 55 && v2 == 0 && v3 == 0) { res4_1 = " 파티원 (생/마/스 회복속도 50%~70%, 마법/궁술속도50%~70%, 근접대미지/생명력/크리티컬확률 50%~70%, 최대대미지 70%)" }
    else if (res1 < 130 && (130 - res1) <= 60 && v2 == 0 && v3 == 0) { res4_1 = " 파티원 (생/마/스 회복속도 50%, 마법/궁술속도50%, 근접대미지/생명력/크리티컬확률 50%, 최대대미지 50%~70%) " }
    else if (res1 < 130 && (130 - res1) <= 65 && v2 == 0 && v3 == 0) { res4_1 = " 파티원 (생/마/스 회복속도 50%, 마법/궁술속도50%, 근접대미지/생명력/크리티컬확률 50%, 최대대미지 50%~70%)" }
    else if (res1 < 130 && (130 - res1) <= 70 && v2 == 0 && v3 == 0) { res4_1 = " 파티원 (생명력 50%, 최대대미지 50%)" }
    // else if (res1 < 130 && (130 - res1) <= 85 && v2 == 0 && v3 == 0) { res4_1 = " 파티원 (최대대미지 50%)" }
    else if (res1 < 130 && (130 - res1) <= 90 && v2 == 0 && v3 == 0) { res4_1 = " 파티원 (최대대미지 50%)" }

    else { res4_1 = "" }

    document.getElementById("res4_1").value = res4_1;



    var res5; // SS 만들기

    if (res1 < 190 && (190 - res1) <= 10 && v2 == 0 && v3 != 0) { res5 = "몬스터 (생명력 150%~500%, 대미지 150%~500%, 몹등장수 150%~200% 보호/방어 110%~150% 지력/행운120%~200%)" }
    else if (res1 < 190 && (190 - res1) <= 15 && v2 == 0 && v3 != 0) { res5 = "몬스터 (방어/보호120%~150%, 대미지/생명력 300%~500%, 등장수 150%~200%, 지력/행운 150%~200%)" }
    else if (res1 < 190 && (190 - res1) <= 20 && v2 == 0 && v3 != 0) { res5 = "몬스터 (방어/보호120%~150%, 대미지/생명력 300~500%, 등장수 150~200%, 지력/행운 200% )" }
    else if (res1 < 190 && (190 - res1) <= 25 && v2 == 0 && v3 != 0) { res5 = "몬스터 (방어/보호 150%, 대미지/생명력 300%~500%, 등장수200%)" }
    else if (res1 < 190 && (190 - res1) <= 30 && v2 == 0 && v3 != 0) { res5 = "몬스터 (보호 150%, 대미지/생명력 300%~500%, 등장수 200%)" }
    else if (res1 < 190 && (190 - res1) <= 40 && v2 == 0 && v3 != 0) { res5 = "몬스터 (등장수 200%, 생명력/대미지 500%)" }
    else if (res1 < 190 && (190 - res1) <= 45 && v2 == 0 && v3 != 0) { res5 = "몬스터 (생명력/대미지 500%)" }

    else if (res1 < 190 && (190 - res1) <= 10 && v2 != 0 && v3 == 0) { res5 = "파티원 (생/마/스 회복속도 50%~70%, 마법/궁술속도50%~70%, 근접대미지/생명력/크리티컬확률 50%~70%, 최대대미지 50~70%)" }
    // else if (res1 < 190 && (190 - res1) <= 15 && v2 != 0 && v3 == 0) { res5 = "파티원 (생/마/스 회복속도 50%, 마법/궁술속도50%, 근접대미지/생명력/크리티컬확률 50%, 최대대미지 50%~70%)" }
    else if (res1 < 190 && (190 - res1) <= 20 && v2 != 0 && v3 == 0) { res5 = "파티원 (생/마/스 회복속도 50%, 마법/궁술속도50%, 근접대미지/생명력/크리티컬확률 50%, 최대대미지 50%~70%)" }
    else if (res1 < 190 && (190 - res1) <= 30 && v2 != 0 && v3 == 0) { res5 = "파티원 (생명력 50%, 최대대미지 50%)" }
    else if (res1 < 190 && (190 - res1) <= 45 && v2 != 0 && v3 == 0) { res5 = "파티원 (최대대미지 50%)" }


    else if (res1 < 190 && (190 - res1) <= 55 && v2 == 0 && v3 == 0) { res5 = "몬스터 (생명력 150%~500%, 대미지 150%~500%, 몹등장수 150%~200% 보호/방어 110%~150% 지력/행운120%~200%) " }
    else if (res1 < 190 && (190 - res1) <= 60 && v2 == 0 && v3 == 0) { res5 = "몬스터 (방어/보호120%~150%, 대미지/생명력 300%~500%, 등장수 150%~200%, 지력/행운 150%~200%) " }
    else if (res1 < 190 && (190 - res1) <= 65 && v2 == 0 && v3 == 0) { res5 = "몬스터 (방어/보호120%~150%, 대미지/생명력 300~500%, 등장수 150~200%, 지력/행운 200% ) " }
    else if (res1 < 190 && (190 - res1) <= 70 && v2 == 0 && v3 == 0) { res5 = "몬스터 (보호 150%, 대미지/생명력 300%~500%, 등장수 200%) " }
    else if (res1 < 190 && (190 - res1) <= 85 && v2 == 0 && v3 == 0) { res5 = "몬스터 (등장수 200%, 생명력/대미지 500%) " }
    else if (res1 < 190 && (190 - res1) <= 90 && v2 == 0 && v3 == 0) { res5 = "몬스터 (생명력/대미지 500%)" }

    else { res5 = "만들수 없거나 다음레벨로 넘어감" }


    document.getElementById("res5").value = res5;


    var res5_1; // ss 만들기
    if (res1 < 190 && (190 - res1) <= 55 && v2 == 0 && v3 == 0) { res5_1 = " 파티원 (생/마/스 회복속도 50%~70%, 마법/궁술속도50%~70%, 근접대미지/생명력/크리티컬확률 50%~70%, 최대대미지 70%)" }
    else if (res1 < 190 && (190 - res1) <= 60 && v2 == 0 && v3 == 0) { res5_1 = " 파티원 (생/마/스 회복속도 50%, 마법/궁술속도50%, 근접대미지/생명력/크리티컬확률 50%, 최대대미지 50%~70%) " }
    else if (res1 < 190 && (190 - res1) <= 65 && v2 == 0 && v3 == 0) { res5_1 = " 파티원 (생/마/스 회복속도 50%, 마법/궁술속도50%, 근접대미지/생명력/크리티컬확률 50%, 최대대미지 50%~70%)" }
    else if (res1 < 190 && (190 - res1) <= 70 && v2 == 0 && v3 == 0) { res5_1 = " 파티원 (생명력 50%, 최대대미지 50%)" }
    // else if (res1 < 190 && (190 - res1) <= 85 && v2 == 0 && v3 == 0) { res5_1 = " 파티원 (최대대미지 50%)" }
    else if (res1 < 190 && (190 - res1) <= 90 && v2 == 0 && v3 == 0) { res5_1 = " 파티원 (최대대미지 50%)" }

    else { res5_1 = "" }

    document.getElementById("res5_1").value = res5_1;

}

function fetchData(selectId) {
    const selectElement = document.getElementById(selectId);
    const selectedOption = selectElement.options[selectElement.selectedIndex];
    const selectedItem = selectedOption.getAttribute("data-label") || selectedOption.value;
    const MABINOGI_API_KEY = "MABINOGI_API_KEY";


    if (!selectedItem || selectedItem === "0") {
        console.error("아이템이 선택되지 않았습니다.");
        document.getElementById(selectId + "-price").textContent = "- G";
        return;
    }

    const fullItemName = `알반 기사단의 훈련석 ${selectedItem}`;
    const encodedItemName = encodeURIComponent(fullItemName);
    console.log(`Fetching data for ${selectId}:`, fullItemName, "Encoded:", encodedItemName);
    
    fetch(`https://open.api.nexon.com/mabinogi/v1/auction/list?auction_item_category=%EC%95%8C%EB%B0%98%20%ED%9B%88%EB%A0%A8%EC%84%9D&item_name=${encodedItemName}`, {
        headers: { 'x-nxopen-api-key':MABINOGI_API_KEY}
    })
    .then(response => response.json())
    .then(data => {
        console.log(`Received data for ${selectId}:`, data);
        if (data.auction_item && data.auction_item.length > 0) {
            let lowestPrice = Math.min(...data.auction_item.map(item => item.auction_price_per_unit));
            document.getElementById(selectId + "-price").textContent = lowestPrice.toLocaleString() + " G";
        } else {
            document.getElementById(selectId + "-price").textContent = "- G";
        }
    })
    .catch(error => console.error("데이터를 불러오는 중 오류 발생:", error));
}
